#+Title: Estados do Brasil

https://en.wikipedia.org/wiki/States_of_Brazil


#+name: dados
| Acre                | AC | Rio Branco     |
| Alagoas             | AL | Maceió         |
| Amapá               | AP | Macapá         |
| Amazonas            | AM | Manaus         |
| Bahia               | BA | Salvador       |
| Ceará               | CE | Fortaleza      |
| Distrito Federal    | DF | Brasília       |
| Espírito Santo      | ES | Vitória        |
| Goiás               | GO | Goiânia        |
| Maranhão            | MA | São Luís       |
| Mato Grosso         | MT | Cuiabá         |
| Mato Grosso do Sul  | MS | Campo Grande   |
| Minas Gerais        | MG | Belo Horizonte |
| Pará                | PA | Belém          |
| Paraíba             | PB | João Pessoa    |
| Paraná              | PR | Curitiba       |
| Pernambuco          | PE | Recife         |
| Piauí               | PI | Teresina       |
| Rio de Janeiro      | RJ | Rio de Janeiro |
| Rio Grande do Norte | RN | Natal          |
| Rio Grande do Sul   | RS | Porto Alegre   |
| Rondônia            | RO | Porto Velho    |
| Roraima             | RR | Boa Vista      |
| Santa Catarina      | SC | Florianópolis  |
| São Paulo           | SP | São Paulo      |
| Sergipe             | SE | Aracaju        |
| Tocantins           | TO | Palmas         |


#+BEGIN_SRC lisp :var dados=dados :results output
 (mapcar (lambda (d) (format t "~a,3,~a,~a~%" (car d) (car d) (cadr d))) dados)
#+END_SRC

#+RESULTS:
#+begin_example
Acre,3,Acre,AC
Alagoas,3,Alagoas,AL
Amapá,3,Amapá,AP
Amazonas,3,Amazonas,AM
Bahia,3,Bahia,BA
Ceará,3,Ceará,CE
Distrito Federal,3,Distrito Federal,DF
Espírito Santo,3,Espírito Santo,ES
Goiás,3,Goiás,GO
Maranhão,3,Maranhão,MA
Mato Grosso,3,Mato Grosso,MT
Mato Grosso do Sul,3,Mato Grosso do Sul,MS
Minas Gerais,3,Minas Gerais,MG
Pará,3,Pará,PA
Paraíba,3,Paraíba,PB
Paraná,3,Paraná,PR
Pernambuco,3,Pernambuco,PE
Piauí,3,Piauí,PI
Rio de Janeiro,3,Rio de Janeiro,RJ
Rio Grande do Norte,3,Rio Grande do Norte,RN
Rio Grande do Sul,3,Rio Grande do Sul,RS
Rondônia,3,Rondônia,RO
Roraima,3,Roraima,RR
Santa Catarina,3,Santa Catarina,SC
São Paulo,3,São Paulo,SP
Sergipe,3,Sergipe,SE
Tocantins,3,Tocantins,TO
#+end_example

